Revit 2027 API
ViewPlan.SetUnderlayOrientation Method
 Sets the underlay orientation for this view.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetUnderlayOrientation(
	UnderlayOrientation uo
)
Public Sub SetUnderlayOrientation (
	uo As UnderlayOrientation
)
public:
void SetUnderlayOrientation(
	UnderlayOrientation uo
)
member SetUnderlayOrientation :
        uo : UnderlayOrientation -> unit
Parameters
uo UnderlayOrientation
 The underlay orientation for this view.
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
ViewPlan Class
Autodesk.Revit.DB Namespace